import 'locale_keys.dart';

Map<String, String> hindi() {
  return {
    "about": "हमारे बारे में",
    "accept": "स्वीकारें ",
    "addMaterial": "सामग्री जोड़ें",
    "backAgain": "बाहर निकलने के लिए फिर से दबाएं",
    "balance": "ट्रूक मनी बैलेंस",
    "bookingId": "बुकिंग आईडी",
    "bookingRequested": "बुकिंग आवश्यक है",
    "recievePayment": "प्राप्त भुगतान",
    "paymentConfirmation":
        "मैं एतद्द्वारा पुष्टि करता/करती हूं कि उपरोक्त राशि का भुगतान ग्राहक द्वारा मुझे सफलतापूर्वक कर दिया गया है",
    "chat": "चैट",
    "city": "शहर",
    "updateLocation": "स्थान अपडेट करें",
    "closedTruk": "बंद ट्रक",
    "COD": "डिलवरी पर नकदी",
    "company": "कंपनी",
    "continueBooking": "बुकिंग जारी रखें",
    "delete": "हटाएं",
    "deleteConfirm": "क्या आप हटाना चाहते हैं?",
    "delivered": "पहुंचा दिया",
    "done": "हो गया ",
    "dropLocation": "ड्रॉप स्थान",
    "edit": "संपादित करें",
    "editProfile": "प्रोफ़ाइल संपादित करें",
    "email": "ईमेल आईडी",
    "enterAmount": "राशी डालें",
    "enterDrop": "ड्रॉप स्थान दर्ज करें",
    "enterMobile": "अपना मोबाइल नंबर दर्ज करें?",
    "enterOtp": "आपके पास भेजा गया ओटीपी दर्ज करें",
    "enterPickup": "स्थान चुनें",
    LocaleKey.fullLoad: "पूरा खेप",
    "generateOtp": "ओटीपी जनरेट करें",
    "getStarted": "शुरु  हो जाएँ ",
    "height": "ऊंचाई",
    "home": "घर",
    "insurance": "बीमा",
    "insuranceText1":
        "हां, मेरे कार्गो शिपमेंट को सुरक्षित और बीमा करें। मैंने पढ़ा है, समझा है और इससे सहमत हूं",
    "insuranceText2": "नियम और शर्तें",
    "invalidAmount": "*अवैध राशि",
    "invalidEmail": "*अवैध ईमेल",
    "lease": "पट्टा",
    "length": "लंबाई",
    "loadDimensions": "लोड आयाम (सेमी)",
    "loadType": "लोड प्रकार",
    "logout": "लॉग आउट",
    "mandateType": "जनादेश प्रकार",
    "materialDetails": "सामग्री विवरण",
    "materialName": "सामग्री",
    "materialType": "सामग्री के प्रकार",
    "mobile": "मोबाइल नंबर",
    "more": "अधिक",
    "myRequest": "मेरा निवेदन",
    "name": "नाम",
    "no": "नहीं",
    "noData": "आकड़ा उपलब्ध नहीं",
    "noMaterial": "कोई सामग्री नहीं जोड़ा गया",
    "noNotification": "कोई अधिसूचना नहीं",
    "noQuotesRequested": "कोई उद्धरण आवश्यक नहीं",
    "notEnoughMoney": "शेष पर्याप्त नहीं",
    "onDemand": "मांग पर",
    "ONLINE": "प्री-पेड ऑर्डर",
    "openTruk": "खुला ट्रक",
    "order": "गण",
    "orderSummary": "गण सारांश",
    "otpSuccessful": "ओ.टी.पी. का सफलतापूर्वक मिलान हुआ।",
    LocaleKey.partialLoad: "आंशिक खेप",
    "payments": "भुगतान",
    "paymentSuccess": "भुगतान सफल",
    "pickupDate": "उठाने की तारिक ",
    "pickupLocation": "उठाने की जगह",
    "profileUpdated": "प्रोफाइल अपडेट",
    "promotions": "प्रोन्नति",
    "quantity": "मात्रा",
    "quotes": "उद्धरण",
    "recommended": "सुझाव",
    "registerTitle": "हमें आपके बारे में अधिक बताएं:",
    "reject": "अस्वीकार",
    "rejectConfirm": "क्या आप इस उद्धरण को अस्वीकार करना चाहते हैं?",
    "requestButton": "निवेदन",
    "required": "* आवश्यक है",
    "search": "खोजें ",
    "searchHint": "टाइप ऑर्डर आईडी, पिकअप डेट, किराया …",
    "selectInsurance": "कृपया बीमा का चयन करें",
    "selectLoadType": "लोड प्रकार का चयन करें",
    "selectMandateType": "मैंडेट प्रकार का चयन करें",
    "selectTrukType": "ट्रक प्रकार का चयन करें",
    "settings": "समायोजन",
    "shipmentDetails": "शिपमेंट की जानकारी",
    "shipmentId": "शिपमेंट आईडी",
    "shipments": "मेरी शिपमेंट",
    "shipmentSummary": "शिपमेंट सारांश",
    "state": "राज्य",
    "successful": "सफल",
    "support": "समर्थन",
    "topupWallet": "टॉपअप वॉलेट",
    "track": "धावन पथ",
    "trackShipment": "शिपमेंट ट्रैक करना",
    "trukMoney": "ट्रक मनी",
    "TRUKMONEY": "ट्रक मनी",
    "trukType": "ट्रक का प्रकार",
    "update": "अपडेट करें",
    "vendorName": "विक्रेता का नाम",
    "verifyNow": "अभी सत्यापित करें",
    "walkThroughSubTitle1":
        "अपने बेड़े और ड्राइवरों को अपनी उंगलियों पर प्रबंधित करें",
    "walkThroughSubTitle2":
        "फिंगर टिप पर अपने ट्रक का पता लगाएं और स्टार्ट से एंड तक ऑनलाइन ट्रैक करें।",
    "walkThroughSubTitle3":
        "पूरे भारत से दैनिक आधार पर अपने वाहनों के लिए व्यक्तिगत भार प्राप्त करें।",
    "walkThroughTitle1": "अपने बेड़े का प्रबंधन करें",
    "walkThroughTitle2": "वन टैप ऑनलाइन ट्रैकिंग",
    "walkThroughTitle3": "अपने वाहनों को संलग्न करें",
    "width": "चौड़ाई",
    "yes": "हाँ",
    "yourMaterial": "आपकी सामग्री",
    "startTrip": "ट्रिप शुरू करें",
    "endTrip": "ट्रिप को समाप्त करें",
    "navigatePickup": "पिकअप स्थान पर नेविगेट करें",
    "date": "दिनांक",
    "fare": "किराया",
    "apply": "लागू करें",
    "destination": "गंतव्य",
    "notification": "अधिसूचना",
    "withOutInsurance": "बिना बीमा के",
    "withInsurance": "बीमा के साथ",
    "language": "भाषा",
    "logoutConfirm": "क्या आप लॉगआउट करना चाहते हैं?",
    "gettingLocaiton": "आपका स्थान प्राप्त किया जा रहा है",
    "gpsDisabled": "GPS अक्षम है",
    "gpsDisableMsg":
        "कृपया सुनिश्चित करें कि आप GPS सक्षम करें और पुनः प्रयास करें",
    "gpsDisableError": "कृपया GPS को भविष्यवाणी करने में सक्षम करें",
    "noShipment": "कोई शिपमेंट नहीं",
    "coupon": "कूपन",
    "mobileNotRegistered": "मोबाइल पंजीकृत नहीं है",
    "fleetSelectionTitle": "ट्रकिंग कंपनी / एजेंट",
    "fleetSelectionSubtitle": "हम परिवहन सेवा प्रदान करते हैं",
    "driverSelectionTitle": "चालक",
    "driverSelectionSubtitle": "परिवहन सेवाओं की तलाश में",
    "fleetSelectionScreenTitle": "के रूप में TruKApp में साइन इन करें:",
    "continue": "जारी रखें",
    "quote": "उद्धरण",
    "quoted": "उद्धरित",
    "assigned": "सौंपा है",
    "assignDriver": "चालक को सौपें",
    "accepted": "स्वीकार लिया",
    "rejected": "अस्वीकृत",
    "driverDetails": "ड्राइवर का विवरण",
    "registerDriver": "चालक को पंजीकृत करें",
    "adharPan": "आधार संख्या / पैन",
    "licenseNo": "लाइसेंस नंबर (HCV)",
    "licenseExpiry": "लाइसेंस समाप्ति की तारीख",
    "driverAlreadyExists": "ड्राइवर पहले से ही पंजीकृत है",
    "driverRegistered": "ड्राइवर सफलतापूर्वक पंजीकृत",
    "documents": "दस्तावेज़",
    "upload": "अपलोड",
    "uploaded": "अपलोड किए गए",
    "dl": "ड्राइविंग लाइसेंस",
    "adharCard": "आधार कार्ड",
    "panCard": "पैन कार्ड",
    "selfie": "सेल्फी",
    "trukDetails": "Truk विवरण",
    "addTruk": "Truk जोड़ें",
    "ownerName": "Truk मालिक का नाम",
    "panTin": "पैन / टिन",
    "trukModel": "Truk मॉडल",
    "grossWeight": "सकल वजन (टन)",
    "lengthInFeet": "लंबाई (फीट में)",
    "breadthInFeet": "चौड़ाई (फीट में)",
    "heightInFeet": "ऊंचाई (फीट में)",
    "trukNumber": "Truk नंबर",
    "permitType": "परमिट प्रकार",
    "insuranceDoc": "बीमा दस्तावेज़",
    "fitnessCert": "फिटनेस प्रमाणपत्र",
    "permit": "परमिट",
    "rc": "आर सी",
    "myDriver": "मेरे ड्राइवर",
    "pending": "विचाराधीन",
    "addDriver": "ड्राइवर जोड़ें",
    "noDriver": "कोई ड्राइवर नहीं",
    "available": "उपलब्ध",
    "inTransit": "रास्ते में",
    "myTruks": "मेरे ट्रक",
    "selectDriver": "ड्राइवर का चयन करें",
    "driverAssigned": "ड्राइवर को सौंपा",
    "sendQuote": "भाव भेजें",
    "myStats": "मेरे आंकड़े",
    "companyNo": "पंजीकरण क्रमांक",
    "gstNo": "जीएसटी क्रमांक",
    "showTrip": "यात्रा दिखाएं",
    "trukImage": "ट्रक छवि",
    "pickupImage": "पैकेज छवि",
    "navigate": "नेविगेट करें",
    "navigateToPickup": "पिकअप स्थान पर नेविगेट करें",
    "driverOnline": "ऑनलाइन",
    "driverOffline": "ऑफ़लाइन",
    "myPayouts": "मेरे भुगतान",
    "bankProof": "बैंक प्रमाण",
    "gstRegistration": "जीएसटी पंजीकरण",
    "companyRegistration": "कंपनी पंजीकरण",
    "TC": "इस TRUKAPP वेबसाइट के नियम और शर्तों में वे नियम और शर्तें शामिल हैं जो वेबसाइट तक आपकी पहुंच और उपयोग को नियंत्रित करती हैं (जैसा कि नीचे परिभाषित किया गया है) और यह डॉकवेयर ग्लोबल लॉजिस्टिक्स प्राइवेट लिमिटेड के बीच एक समझौता है। Ltd. (\"TRUKAPP,\" \"हम,\" \"हम,\" या \"हमारा\") और आप या जिस इकाई का आप प्रतिनिधित्व करते हैं (\"आप\" या \"आपका\")। जब आप वेबसाइट एक्सेस करते हैं तो यह समझौता प्रभावी होता है। ये नियम और शर्तें सूचना प्रौद्योगिकी अधिनियम, 2000 (\"आईटी अधिनियम\") और इसके तहत लागू नियमों और समय-समय पर संशोधित विभिन्न विधियों में इलेक्ट्रॉनिक रिकॉर्ड से संबंधित प्रावधानों के संदर्भ में एक इलेक्ट्रॉनिक रिकॉर्ड हैं।\n"
        "आप प्रतिनिधित्व करते हैं और हमें आश्वासन देते हैं कि आप सक्षम हैं और एक अनुबंध में प्रवेश करने की कानूनी क्षमता रखते हैं (अर्थात आपने कम से कम 18 वर्ष की आयु प्राप्त कर ली है, आपके पास अनुबंध अधिनियम के अनुसार अनुबंध करने की क्षमता है)।\n"
        "1.\n"
        "1.1 आम तौर पर। आप निम्नलिखित नियमों और शर्तों के अनुसार वेबसाइट, उत्पादों, सेवा या सुविधा की सामग्री तक पहुंच सकते हैं। आप इन नियमों और शर्तों और वेबसाइट के आपके उपयोग पर लागू सभी कानूनों, नियमों और विनियमों का पालन करने का वचन देते हैं।\n"
        "1.2 आप वचन देते हैं और गारंटी देते हैं कि आपके द्वारा TrukApp को प्रदान की गई कोई भी जानकारी सही और मान्य है। किसी भी गलत जानकारी/प्रतिरूपण/गलत जानकारी को प्रस्तुत करने के मामले में, आप परिणामों के लिए उत्तरदायी होंगे और आप ऐसे किसी भी नुकसान, क्षति, परिणामों के लिए TRUKAPP की क्षतिपूर्ति करेंगे, जिसका इस तरह के उल्लंघन के कारण TRUKAPP को सामना करना पड़ सकता है। यदि यह पाया जाता है कि प्रदान की गई जानकारी झूठी है, तो TRUKAPP इन नियमों और शर्तों के तहत परिकल्पित शर्तों में से किसी के पूर्वाग्रह के बिना तुरंत वेबसाइट तक पहुंच से इनकार कर सकता है, TRUKAPP आपके खिलाफ ऐसी कोई भी कार्रवाई शुरू कर सकता है जैसा वह उचित समझे।\n"
        "1.3 वेबसाइट का आपका निरंतर उपयोग आपके और Trukapp के बीच कानूनी रूप से लागू करने योग्य बाध्यकारी अनुबंध के रूप में काम करेगा।\n"
        "2.\n"
        "2.1. वेबसाइट, उत्पादों, सेवाओं या सुविधाओं के लिए। हम समय-समय पर किसी या सभी सेवा प्रस्तावों को बदल सकते हैं या बंद कर सकते हैं या किसी या सभी सेवा प्रस्तावों की कार्यक्षमता को बदल सकते हैं या हटा सकते हैं।\n"
        "3.\n"
        "3.1 वेबसाइट के आपके उपयोग की शर्त के रूप में, आप वेबसाइट का उपयोग किसी भी ऐसे उद्देश्य (उद्देश्यों) के लिए नहीं करेंगे जो गैरकानूनी या उपयोग की शर्तों द्वारा निषिद्ध है। आप वेबसाइट का उपयोग किसी भी ऐसे तरीके से नहीं करेंगे जो किसी भी TrukApp सर्वर, या किसी भी TrukApp सर्वर से जुड़े नेटवर्क को नुकसान पहुंचा सकता है, अक्षम कर सकता है, अधिक बोझ डाल सकता है, या खराब कर सकता है, या किसी अन्य पार्टी के उपयोग और इससे जुड़ी किसी भी सेवाओं के आनंद में हस्तक्षेप कर सकता है। वेबसाइट। आप हैकिंग, पासवर्ड माइनिंग या किसी अन्य माध्यम से वेबसाइट के किसी भी अनुभाग, अन्य खातों, कंप्यूटर सिस्टम या किसी भी TrukApp सर्वर से जुड़े नेटवर्क या वेबसाइट से जुड़ी किसी भी सेवा तक अनधिकृत पहुंच प्राप्त करने का प्रयास नहीं करेंगे।\n"
        "4.\n"
        "4.1 हमारे पास सेवा की पेशकश में और उसके लिए सभी अधिकार, शीर्षक, और हित, और सभी संबंधित प्रौद्योगिकी और बौद्धिक संपदा अधिकार हैं। इन नियमों और शर्तों की शर्तों के अधीन, हम आपको निम्नलिखित करने के लिए एक सीमित, प्रतिसंहरणीय, गैर-अनन्य, गैर-उप-लाइसेंस योग्य, गैर-हस्तांतरणीय लाइसेंस प्रदान करते हैं: (ए) केवल इन शर्तों के अनुसार सेवाओं का उपयोग और उपयोग करें और शर्तें; आप इन नियमों और शर्तों के तहत किसी भी संबंधित बौद्धिक संपदा अधिकारों सहित, सेवा पेशकशों के हमारे सहयोगियों से कोई अधिकार प्राप्त नहीं करते हैं।\n"
        "4.2 लाइसेंस प्रतिबंध। आप इन नियमों और शर्तों में दिए गए तरीके से वेबसाइट का उपयोग करेंगे। आप इन नियमों और शर्तों द्वारा स्पष्ट रूप से अनुमत के अलावा किसी अन्य उद्देश्य के लिए वेबसाइट का उपयोग नहीं करेंगे। आप वेबसाइट, उत्पादों, सेवाओं या सुविधाओं में किसी भी सामग्री के संशोधित, वितरण, परिवर्तन, छेड़छाड़, मरम्मत, रिवर्स इंजीनियर या अन्यथा व्युत्पन्न कार्यों को बनाने का प्रयास नहीं करेंगे। आप हमारे और आपके बीच के संबंधों को गलत तरीके से प्रस्तुत या अलंकृत नहीं करेंगे (जिसमें यह व्यक्त करना या अर्थ देना शामिल है कि हम आपका या आपके व्यावसायिक प्रयासों का समर्थन, प्रायोजक, समर्थन या योगदान करते हैं)।\n"
        "5.\n"
        "5.1 सामान्य। आप हमें, हमारे सहयोगियों और हमारे/उनके संबंधित कर्मचारियों, अधिकारियों, निदेशकों, और प्रतिनिधियों में से किसी भी तीसरे पक्ष के दावे से या उससे संबंधित किसी भी नुकसान से बचाव, क्षतिपूर्ति और नुकसान पहुंचाएंगे: (ए) आपके वेबसाइट, उत्पादों, सेवाओं या सुविधाओं का उपयोग; (बी) इन नियमों और शर्तों का उल्लंघन या आपके द्वारा लागू कानून का उल्लंघन; या आप हमें उचित वकीलों की फीस के साथ-साथ हमारे कर्मचारियों और ठेकेदारों के समय और सामग्री के लिए प्रतिपूर्ति करने के लिए उत्तरदायी होंगे जो किसी तीसरे पक्ष के नोटिस या अन्य अनिवार्य कानूनी आदेश या तीसरे पक्ष के दावों से जुड़ी प्रक्रिया के नुकसान के जवाब में खर्च किए गए हैं। / नुकसान हुआ है।\n"
        "6. वेबसाइट और इसकी विशेषताएं \"जैसा है\" प्रदान की गई हैं। कानून द्वारा निषिद्ध सीमा को छोड़कर, या किसी भी वैधानिक अधिकार को लागू करने की सीमा तक, जिसे बाहर नहीं किया जा सकता है, सीमित या माफ नहीं किया जा सकता है, हम और हमारे सहयोगी (ए) किसी भी प्रकार का कोई प्रतिनिधित्व या वारंटी नहीं देते हैं, चाहे व्यक्त, निहित, वैधानिक या अन्यथा के संबंध में सेवा की पेशकश या तीसरे पक्ष की सामग्री, और (बी) व्यापारिक योग्यता, संतोषजनक गुणवत्ता, किसी विशेष उद्देश्य के लिए फिटनेस, गैर-उल्लंघन, या शांत आनंद के किसी भी निहित या व्यक्त वारंटी (आई) सहित सभी वारंटी को अस्वीकार करें, (ii) व्यापार के व्यवहार या उपयोग के किसी भी पाठ्यक्रम से उत्पन्न, (iii) सेवा की पेशकश या तृतीय-पक्ष सामग्री निर्बाध, त्रुटि मुक्त या हानिकारक घटकों से मुक्त होगी, और (iv) कि कोई भी सामग्री सुरक्षित होगी या अन्यथा खो नहीं जाएगी या बदल दिया।\n"
        "7. हम और हमारे सहयोगी किसी भी प्रत्यक्ष, अप्रत्यक्ष, आकस्मिक, विशेष, परिणामी या अनुकरणीय क्षति (लाभ, राजस्व, ग्राहकों, अवसरों, सद्भावना, उपयोग या डेटा के नुकसान सहित) के लिए आपके प्रति उत्तरदायी नहीं होंगे, भले ही कोई पक्ष इस तरह के नुकसान की संभावना की सलाह दी गई है। इसके अलावा, न तो हम और न ही हमारा कोई भी सहयोगी निम्नलिखित के संबंध में किसी भी मुआवजे, प्रतिपूर्ति, या नुकसान के लिए जिम्मेदार होगा: (ए) सेवाओं का उपयोग करने में आपकी अक्षमता, जिसमें इस समझौते के किसी भी (आई) समाप्ति या निलंबन के परिणामस्वरूप शामिल हैं। या आपके द्वारा उपयोग या सेवा की पेशकशों तक पहुंच, (ii) किसी भी या सभी सेवा प्रसादों को बंद करना, या, (iii) ऑर्डर स्तर के समझौतों के तहत किसी भी दायित्वों को सीमित किए बिना, सभी या एक हिस्से का कोई अप्रत्याशित या अनिर्धारित डाउनटाइम किसी भी कारण से सेवाओं का; (बी) स्थानापन्न वस्तुओं या सेवाओं की खरीद की लागत; (सी) इस समझौते के संबंध में आपके द्वारा किए गए किसी भी निवेश, व्यय, या प्रतिबद्धताओं या सेवा प्रसाद के आपके उपयोग या पहुंच के संबंध में; या (डी) आपकी किसी भी सामग्री या अन्य डेटा को संग्रहीत करने में किसी भी अनधिकृत पहुंच, परिवर्तन, या विलोपन, विनाश, क्षति, हानि या विफलता।\n"
        "8. हम TRUKAPP वेबसाइट पर एक संशोधित संस्करण पोस्ट करके किसी भी समय इन नियमों और शर्तों (किसी भी नीतियों सहित) को संशोधित कर सकते हैं; इन नियमों और शर्तों में किसी भी संशोधन की प्रभावी तिथि के बाद वेबसाइट का उपयोग जारी रखते हुए, आप संशोधित शर्तों से बाध्य होने के लिए सहमत हैं। इन नियमों और शर्तों में संशोधन के लिए नियमित रूप से TRUKAPP साइट की जाँच करना आपकी ज़िम्मेदारी है। इन नियमों और शर्तों को इन नियमों और शर्तों के अंत में उल्लिखित तिथि पर अंतिम बार संशोधित किया गया था।\n"
        "9. गोपनीयता नीति\n"
        "9.1 हमारी सेवाओं का लाभ उठाने या इस वेबसाइट का लाभ प्राप्त करने के लिए आपको अपनी व्यक्तिगत जानकारी प्रदान करने के लिए कहा जा सकता है। हम परिवहन के किसी भी विवरण, पंजीकरण के समय आपके द्वारा प्रदान की गई व्यक्तिगत जानकारी, ऑर्डर की बुकिंग, किसी भी लागू कानून के तहत आवश्यक को छोड़कर, या हमारे लिए आवश्यक सीमित सीमा तक साझा नहीं करने के लिए हर उचित प्रयास करेंगे। एक ट्रक रखें और हमारे सेवा भागीदारों/बाजार के किराए के माध्यम से आवश्यक सेवा प्रदान करें, हमारे उत्पादों, सेवाओं, सामग्री और विज्ञापन को प्रदान करने और सुधारने के लिए इसे अन्य जानकारी के साथ जोड़ सकते हैं। हम किसी भी घटना में परिणामों के लिए कोई दायित्व नहीं उठाएंगे, जहां आपकी जानकारी स्वेच्छा से या अनजाने में किसी तीसरे पक्ष के साथ साझा की गई है।\n"
        "9.2 आप एतद्द्वारा अपने पंजीकृत फोन नंबर और/या ई-मेल पते, यदि कोई हो, के माध्यम से हमसे संचार प्राप्त करने के लिए स्पष्ट रूप से सहमति देते हैं। आप हमारे द्वारा फोन कॉल, ईमेल और/या एसएमएस सूचनाओं के माध्यम से संपर्क करने की सहमति देते हैं। आप सहमत हैं कि हमारे द्वारा आपके द्वारा प्राप्त किसी भी संचार को स्पैम, अवांछित संचार या राष्ट्रीय कॉल न करें रजिस्ट्री पर आपके पंजीकरण का उल्लंघन नहीं माना जाएगा।\n"
        "9.3 आप इस वेबसाइट के माध्यम से एप्लिकेशन या हमारे द्वारा प्रदान की जाने वाली किसी भी सेवा के माध्यम से हमें भेजे गए किसी भी संदेश या ट्रांसमिटल की उत्पत्ति को छिपाने के लिए हेडर या अन्यथा पहचानकर्ताओं में हेरफेर नहीं करेंगे।\n"
        "9.4 आप इस वेबसाइट या इसके साथ प्रदान की गई किसी भी सामग्री का उपयोग किसी भी उद्देश्य के लिए नहीं करेंगे जो इन नियमों और शर्तों द्वारा गैरकानूनी या निषिद्ध है या किसी भी अवैध गतिविधि के प्रदर्शन का अनुरोध करने के लिए जो हमारे या किसी तीसरे पक्ष के अधिकारों का उल्लंघन करती है।\n"
        "9.5 आप समझेंगे कि TRUKAPP के पास किसी भी कानून, विनियम या किसी भी सरकार द्वारा मांगी गई जानकारी को संतुष्ट करने के लिए आवश्यक किसी भी जानकारी (वेबसाइट पर जानकारी या सामग्री प्रदान करने वाले व्यक्ति की पहचान सहित) का खुलासा करने का अधिकार है। एजेंसी। इस मामले में, आप स्पष्ट रूप से हमें अपनी/इकाई की ऐसी जानकारी साझा करने के लिए अधिकृत करते हैं जिसका आप ऐसी सरकार को प्रतिनिधित्व कर रहे हैं। एजेंसी।\n"
        "10.\n"
        "10.1 हम और हमारे सहयोगी इन नियमों और शर्तों के तहत किसी भी दायित्व को निभाने में किसी भी देरी या विफलता के लिए उत्तरदायी (अप्रत्याशित) नहीं होंगे, जहां देरी या विफलता हमारे उचित नियंत्रण से परे किसी भी कारण से होती है, जिसमें भगवान के कार्य, श्रम विवाद या अन्य शामिल हैं। औद्योगिक गड़बड़ी, बिजली या बिजली की कटौती, उपयोगिताओं या अन्य दूरसंचार विफलताओं, भूकंप, तूफान या प्रकृति के अन्य तत्व, रुकावटें, प्रतिबंध, दंगे, सरकार के कार्य या आदेश, आतंकवाद के कार्य या युद्ध।\n"
        "10.2 भारत के कानून, कानूनी नियमों के विरोध के संदर्भ के बिना, इन नियमों और शर्तों और आपके और हमारे बीच उत्पन्न होने वाले किसी भी प्रकार के किसी भी विवाद को नियंत्रित करते हैं।\n"
        "10.3 वेबसाइट के आपके उपयोग, या TRUKAPP द्वारा बेचे या वितरित किए गए किसी भी उत्पाद या सेवाओं से संबंधित किसी भी विवाद या दावे को मध्यस्थता और सुलह अधिनियम, 1996 या किसी भी बाद के संशोधनों के अनुसार मध्यस्थता के माध्यम से हल किया जाएगा। वही। मध्यस्थता का स्थान बेंगलुरु होगा। मध्यस्थता की भाषा अंग्रेजी में होगी।\n"
        "10.4 आप सभी लागू कानूनों, नियमों और विनियमों का पालन करेंगे।\n"
        "10.5 इस नियम और शर्तों के अनुसार किए गए या दिए गए सभी संचार और नोटिस अंग्रेजी भाषा में होने चाहिए। यदि हम इस नियम और शर्तों के अंग्रेजी भाषा संस्करण का अनुवाद प्रदान करते हैं, तो कोई विरोध होने पर नियम और शर्तों का अंग्रेजी भाषा संस्करण नियंत्रित होगा।\n"
        "10.6 आप टर्म के दौरान या टर्म की समाप्ति के बाद 5 साल की अवधि के दौरान किसी भी समय TRUKAPP गोपनीय जानकारी का खुलासा नहीं करेंगे। आप TRUKAPP गोपनीय जानकारी के प्रकटीकरण, प्रसार या अनधिकृत उपयोग से बचने के लिए सभी उचित उपाय करेंगे, जिसमें कम से कम वे उपाय शामिल हैं जो आप समान प्रकृति की अपनी गोपनीय जानकारी की सुरक्षा के लिए करते हैं। आप इन नियमों और शर्तों या TrukApp द्वारा दी गई सेवा के आपके उपयोग के संबंध में कोई प्रेस विज्ञप्ति जारी नहीं करेंगे या कोई अन्य सार्वजनिक संचार नहीं करेंगे।\n"
        "10.7 इन नियमों और शर्तों में बताए गए को छोड़कर, ये नियम और शर्तें किसी भी व्यक्ति या संस्था में कोई तृतीय-पक्ष लाभार्थी अधिकार नहीं बनाती हैं।\n"
        "10.8 इन नियमों और शर्तों के किसी भी प्रावधान को लागू करने में हमारे द्वारा विफलता ऐसे प्रावधान की वर्तमान या भविष्य की छूट का गठन नहीं करेगी और न ही बाद में इस तरह के प्रावधान को लागू करने के हमारे अधिकार को सीमित करेगी। प्रभावी होने के लिए हमारे द्वारा सभी छूट लिखित रूप में होनी चाहिए।\n"
        "10.9 यदि इन नियमों और शर्तों के किसी भी हिस्से को अमान्य या अप्रवर्तनीय माना जाता है, तो नियम और शर्तों के शेष भाग पूरी तरह से लागू और प्रभावी रहेंगे। किसी भी अमान्य या अप्रवर्तनीय भाग को मूल भाग के प्रभाव और आशय के रूप में व्याख्यायित किया जाएगा। यदि ऐसा निर्माण संभव नहीं है, तो अमान्य या अप्रवर्तनीय भाग को इन नियमों और शर्तों से अलग कर दिया जाएगा, लेकिन शेष नियम और शर्तें पूरी तरह से लागू और प्रभावी रहेंगी।\n"
        "11.\n"
        "वेबसाइट तीसरे पक्ष की जानकारी उपलब्ध कराती है, जिसमें लेख, विश्लेषक रिपोर्ट, समाचार रिपोर्ट, गणना की सुविधा के लिए उपकरण, कंपनी की जानकारी और वित्तीय बाजारों के बारे में डेटा, किसी भी नियामक प्राधिकरण और अन्य वित्तीय बाजारों और बाहरी स्रोतों से अन्य डेटा शामिल हैं (\"तृतीय पक्ष\" \"सामग्री\")। आप स्वीकार करते हैं और सहमत होते हैं कि तृतीय पक्ष सामग्री TrukApp द्वारा निर्मित या समर्थित नहीं है। तृतीय पक्ष सामग्री का प्रावधान केवल सामान्य सूचनात्मक उद्देश्यों के लिए है और किसी भी प्रतिभूति या शेयरों को खरीदने या बेचने या किसी अन्य प्रकार के निवेश या निवेश निर्णय लेने के लिए सिफारिश या आग्रह नहीं है। इसके अतिरिक्त, तृतीय पक्ष सामग्री का उद्देश्य कर, कानूनी या निवेश संबंधी सलाह देना नहीं है। आप स्वीकार करते हैं कि आपको प्रदान की गई तृतीय पक्ष सामग्री विश्वसनीय माने जाने वाले स्रोतों से प्राप्त की गई है, लेकिन यह कि TrukApp या तृतीय पक्ष सामग्री के प्रदाताओं द्वारा इसकी सटीकता, पूर्णता, समयबद्धता की कोई गारंटी नहीं दी जाती है।\n"
        "किसी भी तीसरे पक्ष की सामग्री का उपयोग करके, आप इस वेबसाइट को छोड़ सकते हैं और बाहरी वेबसाइट पर या TrukApp के अलावा किसी अन्य संस्था द्वारा बनाए गए वेबसाइट पर निर्देशित हो सकते हैं। यदि आप ऐसी किसी साइट पर जाने का निर्णय लेते हैं, तो आप अपने जोखिम पर ऐसा करते हैं और वायरस या किसी अन्य विनाशकारी तत्वों से बचाव के लिए सभी सुरक्षात्मक उपाय करना आपकी जिम्मेदारी है। TrukApp किसी भी लिंक की गई वेबसाइट या उस पर दिखाई देने वाली जानकारी या उस पर वर्णित किसी भी उत्पाद या सेवाओं के संबंध में कोई वारंटी या प्रतिनिधित्व नहीं करता है, और न ही समर्थन करता है। लिंक का मतलब यह नहीं है कि TrukApp या यह वेबसाइट प्रायोजक, समर्थन, संबद्ध या संबद्ध है, या कानूनी रूप से किसी भी ट्रेडमार्क, व्यापार नाम, लोगो या कॉपीराइट प्रतीक का उपयोग करने के लिए अधिकृत है या लिंक के माध्यम से पहुंच योग्य है, या कि कोई भी लिंक साइट अधिकृत है TrukApp या इसके किसी भी सहयोगी या सहायक कंपनी के किसी भी ट्रेडमार्क, व्यापार नाम, लोगो या कॉपीराइट प्रतीक का उपयोग करने के लिए।\n"
        "तीसरे पक्ष के विक्रेताओं द्वारा TrukApp ग्राहकों को प्रदान की जाने वाली सेवाओं के लिए, TrukApp माल के नुकसान या माल के गंतव्य स्थान पर डिलीवरी में देरी के लिए उत्तरदायी नहीं है। एक बार बुकिंग पूरी हो जाने के बाद, TrukApp ग्राहक और विक्रेता की आपसी समझ से किए गए किसी भी बदलाव या संशोधन के लिए उत्तरदायी नहीं रहेगा। TrukApp पार्टियों, यानी विक्रेता और ग्राहक के बीच लेनदेन को सक्षम करने के लिए एक मंच है। इस परिदृश्य में विक्रेता लॉजिस्टिक्स पार्टनर या ट्रक प्रदाता या व्यक्तिगत ट्रक मालिक या ट्रक ड्राइवर हैं; ग्राहक सेवा की बुकिंग करने वाला व्यक्ति है।",
    "about_text": "TruKApp एक क्रांतिकारी एप्लिकेशन है जो शिपर्स को लाइव ट्रक मार्केट से जोड़ता है और देश भर में परेशानी मुक्त कार्गो शिपमेंट बुकिंग को सक्षम बनाता है। हम अपनी अत्याधुनिक तकनीकों के माध्यम से ट्रांसपोर्टरों को ट्रक लोड पहचान, बेड़े प्रबंधन सेवाएं आदि जैसी कई अन्य सेवाएं भी प्रदान करते हैं।\n\n"
        "इसकी स्थापना जनवरी 2021 में एनआईटी वारंगल अल्मामेटर के उत्साही उद्यमियों के एक समूह द्वारा की गई थी।\n\n"
        "TrukApp यहां इंटरसिटी से इंट्रासिटी ट्रांसपोर्टेशन, फुल ट्रक लोड से लेकर आंशिक ट्रक लोड डिलीवरी तक, किसी भी प्रकार के कार्गो के लिए ट्रक स्पेस की पहचान करने और ट्रांसपोर्टरों के लिए फ्लीट मैनेजमेंट इंटरफेस के लिए लॉजिस्टिक्स को आसान बनाने के लिए है।\n\n"
        "प्रौद्योगिकी की मदद से, TrukApp कार्गो डिलीवरी जीवन चक्र के शुरू से अंत तक विश्व स्तर का समर्थन प्रदान करता है। हमारी प्रौद्योगिकियां जैसे रीयल-टाइम कार्गो ट्रैकिंग, माल सुरक्षा, बेड़े प्रबंधन, एकीकृत भुगतान गेटवे आदि शिपर्स और ट्रांसपोर्टर्स दोनों को अपनी उंगलियों पर लेनदेन करने में सक्षम बनाती हैं।\n\n"
        "यह हम हैं, TrukApp - लॉजिस्टिक्स सरलीकृत!",
    LocaleKey.cancelled: "बुकिंग रद्द",
  };
}
