import 'locale_keys.dart';

Map<String, String> telugu() {
  return {
    "about": "మా గురించి",
    "accept": "అంగీకరించండి",
    "addMaterial": "మెటీరియల్ జోడించండి",
    "backAgain": "నిష్క్రమించడానికి మళ్ళీ తిరిగి నొక్కండి",
    "balance": "ట్రక్ మనీ బ్యాలెన్స్",
    "bookingId": "బుకింగ్ ID",
    "bookingRequested": "బుకింగ్ అభ్యర్థించబడింది",
    "updateLocation":"స్థానాన్ని నవీకరించండి",
    "chat": "చాట్",
    "city": "నగరం",
    "closedTruk": "క్లోజ్డ్ ట్రక్",
    "COD": "వస్తువులు అందిన తరువాత నగదు చెల్లించడం",
    "company": "కంపెనీ",
    "continueBooking": "బుకింగ్ కొనసాగించండి",
    "delete": "తొలగించు",
    "recievePayment":"చెల్లింపు చెల్లింపు",
  "paymentConfirmation":"పైన పేర్కొన్న మొత్తం కస్టమర్ నాకు విజయవంతంగా చెల్లించినట్లు నేను దీని ద్వారా ధృవీకరిస్తున్నాను",
    "deleteConfirm": "మీరు తొలగించాలనుకుంటున్నారా?",
    "delivered": "పంపిణీ చేయబడింది",
    "done": "పూర్తి",
    "dropLocation": "స్థానాన్ని వదలండి",
    "edit": "సవరించండి",
    "editProfile": "ప్రొఫైల్‌ను సవరించండి",
    "email": "ఇమెయిల్ ID",
    "enterAmount": "మొత్తాన్ని నమోదు చేయండి",
    "enterDrop": "డ్రాప్ స్థానాన్ని నమోదు చేయండి",
    "enterMobile": "మీ మొబైల్ నెంబర్ ను ఎంటర్ చేయండి",
    "enterOtp": "మీకు పంపిన OTP ని నమోదు చేయండి",
    "enterPickup": "పికప్ స్థానాన్ని నమోదు చేయండి",
    "fullTruk": "పూర్తి ట్రక్",
    "generateOtp": "OTP ను రూపొందించండి",
    "getStarted": "ప్రారంభించడానికి",
    "height": "ఎత్తు",
    "home": "హోమ్",
    "insurance": "భీమా",
    "insuranceText1":
        "అవును, నా కార్గో రవాణాను సురక్షితంగా మరియు భీమా చేయండి. నేను చదివాను, అర్థం చేసుకున్నాను మరియు అంగీకరిస్తున్నాను",
    "insuranceText2": "నిబంధనలు మరియు షరతులు",
    "invalidAmount": "* చెల్లని మొత్తం",
    "invalidEmail": "* చెల్లని ఇమెయిల్",
    "lease": "లీజు",
    "length": "పొడవు",
    "loadDimensions": "కొలతలు లోడ్ (సెం.మీ)",
    "loadType": "లోడ్ రకం",
    "logout": "లాగ్ అవుట్",
    "mandateType": "తప్పనిసరి రకం",
    "materialDetails": "మెటీరియల్ వివరాలు",
    "materialName": "మెటీరియల్",
    "materialType": "మెటీరియల్ రకం",
    "mobile": "మొబైల్ సంఖ్య",
    "more": "మరింత",
    "myRequest": "నా అభ్యర్థన",
    "name": "పేరు",
    "no": "లేదు",
    "noData": "సమాచారం లేదు",
    "noMaterial": "మెటీరియల్ జోడించబడలేదు",
    "noNotification": "నోటిఫికేషన్ లేదు",
    "noQuotesRequested": "కోట్స్ అభ్యర్థించబడలేదు",
    "notEnoughMoney": "తగినంత బ్యాలెన్స్ లేదు",
    "onDemand": "కోరిక మేరకు",
    "ONLINE": "ప్రీ-పెయిడ్ ఆర్డర్",
    "openTruk": "ఓపెన్ ట్రక్",
    "order": "ఆర్డర్",
    "orderSummary": "కొనుగోలు వివరణ",
    "otpSuccessful": "Otp విజయవంతంగా సరిపోలింది.",
    "partialTruk": "పాక్షిక ట్రక్",
    "payments": "చెల్లింపులు",
    "paymentSuccess": "చెల్లింపు విజయవంతమైంది",
    "pickupDate": "తేదీ ఎంచుకొని",
    "pickupLocation": "స్థానాన్ని ఎంచుకొని",
    "profileUpdated": "ప్రొఫైల్ నవీకరణ",
    "promotions": "పదోన్నతులు",
    "quantity": "పరిమాణం",
    "quotes": "కోట్స్",
    "recommended": "సిఫార్సు చేయబడింది",
    "registerTitle": "మీ గురించి మాకు మరింత చెప్పండి:",
    "reject": "తిరస్కరించండి",
    "rejectConfirm": "మీరు ఈ కోట్‌ను తిరస్కరించాలనుకుంటున్నారా?",
    "requestButton": "అభ్యర్థన",
    "required": "* అవసరం",
    "search": "వెతకండి",
    "searchHint": "ఆర్డర్ ఐడి, పికప్ తేదీ, ఛార్జీలు…",
    "selectInsurance": "దయచేసి బీమాను ఎంచుకోండి",
    "selectLoadType": "లోడ్ రకాన్ని ఎంచుకోండి",
    "selectMandateType": "మాండేట్ రకాన్ని ఎంచుకోండి",
    "selectTrukType": "ట్రక్ రకాన్ని ఎంచుకోండి",
    "settings": "సెట్టింగులు",
    "shipmentDetails": "పంపిణీ వివరాలు",
    "shipmentId": "రవాణా ID",
    "shipments": "నా ఎగుమతులు",
    "shipmentSummary": "రవాణా సారాంశం",
    "state": "రాష్ట్రం",
    "successful": "విజయవంతమైంది",
    "support": "మద్దతు",
    "topupWallet": "టాపప్ వాలెట్",
    "track": "ట్రాక్",
    "trackShipment": "రవాణా రవాణా",
    "trukMoney": "ట్రక్ డబ్బు",
    "TRUKMONEY": "ట్రక్ డబ్బు",
    "trukType": "ట్రక్ రకం",
    "update": "నవీకరణ",
    "vendorName": "విక్రేత యొక్క పేరు",
    "verifyNow": "ఇప్పుడు ధృవీకరించండి",
    "walkThroughSubTitle1": "మీ వేలికొనలకు మీ విమానాల మరియు డ్రైవర్లను నిర్వహించండి",
    "walkThroughSubTitle2":
        "ఫింగర్ చిట్కాపై మీ ట్రక్కును కనుగొని, ప్రారంభం నుండి చివరి వరకు ఆన్‌లైన్‌లో ట్రాక్ చేయండి.",
    "walkThroughSubTitle3": "భారతదేశం నలుమూలల నుండి ప్రతిరోజూ మీ వాహనాల కోసం వ్యక్తిగతీకరించిన లోడ్లను పొందండి.",
    "walkThroughTitle1": "మీ విమానాలను నిర్వహించండి",
    "walkThroughTitle2": "వన్ ట్యాప్ ఆన్‌లైన్ ట్రాకింగ్",
    "walkThroughTitle3": "మీ వాహనాలను అటాచ్ చేయండి",
    "width": "వెడల్పు",
    "yes": "అవును",
    "yourMaterial": "మీ మెటీరియల్స్",
    "startTrip": "ట్రిప్ ప్రారంభించండి",
    "endTrip": "యాత్రను ముగించండి",
    "navigatePickup": "పికప్ స్థానానికి నావిగేట్ చేయండి",
    "date": "తేదీ",
    "fare": "ఛార్జీల",
    "apply": "వర్తించు",
    "destination": "గమ్యం",
    "notification": "నోటిఫికేషన్‌లు",
    "withOutInsurance": "భీమా లేకుండా",
    "withInsurance": "భీమాతో",
    "language": "భాష",
    "logoutConfirm": "మీరు లాగ్ అవుట్ చేయాలనుకుంటున్నారా?",
    "gettingLocaiton": "మీ స్థానాన్ని పొందడం",
    "gpsDisabled": "GPS నిలిపివేయబడింది",
    "gpsDisableMsg": "దయచేసి మీరు GPS ను ప్రారంభించి, మళ్లీ ప్రయత్నించండి",
    "gpsDisableError": "దయచేసి GPS అంచనాను ప్రారంభించండి",
    "noShipment": "రవాణా లేదు",
    "coupon": "కూపన్",
    "mobileNotRegistered": "మొబైల్ నమోదు కాలేదు",
    "fleetSelectionTitle": "ట్రకింగ్ కంపెనీ / ఏజెంట్",
    "fleetSelectionSubtitle": "మేము రవాణా సేవలను అందిస్తాము",
    "driverSelectionTitle": "డ్రైవర్",
    "driverSelectionSubtitle": "రవాణా సేవల కోసం వెతుకుతోంది",
    "fleetSelectionScreenTitle": "ట్రూకాప్‌కు ఇలా సైన్ ఇన్ చేయండి:",
    "continue": "కొనసాగించండి",
    "quote": "కోట్",
    "quoted": "కోట్ చేయబడింది",
    "assigned": "కేటాయించారు",
    "assignDriver": "డ్రైవర్‌ను కేటాయించండి",
    "accepted": "అంగీకరించింది",
    "rejected": "తిరస్కరించబడింది",
    "driverDetails": "డ్రైవర్ వివరాలు",
    "registerDriver": "రిజిస్టర్ డ్రైవర్",
    "adharPan": "ఆధార్ సంఖ్య / పాన్",
    "licenseNo": "లైసెన్స్ సంఖ్య (HCV)",
    "licenseExpiry": "లైసెన్స్ గడువు తేదీ",
    "driverAlreadyExists": "డ్రైవర్ ఇప్పటికే నమోదు చేయబడింది",
    "driverRegistered": "డ్రైవర్ విజయవంతంగా నమోదు చేయబడ్డాడు",
    "documents": "పత్రాలు",
    "upload": "అప్లోడ్",
    "uploaded": "అప్‌లోడ్ చేయబడింది",
    "dl": "వాహనం నడపడానికి చట్టబద్ధమైన అర్హత",
    "adharCard": "ఆధార్ కార్డు",
    "panCard": "పాన్ కార్డ్",
    "selfie": "సెల్ఫీ",
    "trukDetails": "ట్రక్ వివరాలు",
    "addTruk": "ట్రూక్ జోడించండి",
    "ownerName": "ట్రక్ యజమాని పేరు",
    "panTin": "పాన్ / టిన్",
    "trukModel": "ట్రక్ మోడల్",
    "grossWeight": "స్థూల బరువు (టన్నులు)",
    "lengthInFeet": "పొడవు (అడుగులలో)",
    "breadthInFeet": "వెడల్పు (అడుగులలో)",
    "heightInFeet": "ఎత్తు (అడుగులలో)",
    "trukNumber": "ట్రక్ సంఖ్య",
    "permitType": "అనుమతి రకం",
    "insuranceDoc": "భీమా పత్రం",
    "fitnessCert": "ఫిట్నెస్ సర్టిఫికేట్",
    "permit": "అనుమతి",
    "rc": "ఆర్.సి.",
    "myDriver": "నా డ్రైవర్లు",
    "pending": "పెండింగ్‌లో ఉంది",
    "addDriver": "డ్రైవర్‌ను జోడించండి",
    "noDriver": "డ్రైవర్లు లేరు",
    "available": "అందుబాటులో ఉంది",
    "inTransit": "ట్రాన్సిట్ లో",
    "myTruks": "నా ట్రక్కులు",
    "selectDriver": "డ్రైవర్‌ను ఎంచుకోండి",
    "driverAssigned": "డ్రైవర్‌కు కేటాయించబడింది",
    "sendQuote": "కోట్ పంపండి",
    "myStats": "నా గణాంకాలు",
    "companyNo": "నమోదు సంఖ్య.",
    "gstNo": "జీఎస్టీ సంఖ్య",
    "showTrip": "ట్రిప్ చూపించు",
    "trukImage": "ట్రక్ చిత్రం",
    "pickupImage": "ప్యాకేజీ చిత్రం",
    "navigate": "నావిగేట్ చేయండి",
    "navigateToPickup": "పికప్ స్థానానికి నావిగేట్ చేయండి",
    "driverOnline": "ఆన్‌లైన్",
    "driverOffline": "ఆఫ్‌లైన్",
    "myPayouts": "నా చెల్లింపులు",
    "bankProof":"बబ్యాంకు రుజువు",
    "gstRegistration":"GST నమోదు",
    "companyRegistration":"కంపెనీ నమోదు",
    "TC":"ఈ TRUKAPP వెబ్‌సైట్ నిబంధనలు మరియు షరతులు వెబ్‌సైట్ యొక్క మీ ప్రాప్యతను మరియు వినియోగాన్ని నియంత్రించే నిబంధనలు మరియు షరతులను కలిగి ఉన్నాయి (క్రింద నిర్వచించినట్లు) మరియు ఇది డాక్‌వేర్ గ్లోబల్ లాజిస్టిక్స్ ప్రైవేట్ లిమిటెడ్ మధ్య ఒప్పందం. లిమిటెడ్ (“TRUKAPP,” “మేము,” “మాకు,” లేదా “మా”) మరియు మీరు లేదా మీరు సూచించే సంస్థ (“మీరు” లేదా “మీ”). మీరు వెబ్‌సైట్‌ను యాక్సెస్ చేసినప్పుడు ఈ ఒప్పందం అమలులోకి వస్తుంది. ఈ నిబంధనలు మరియు షరతులు ఇన్ఫర్మేషన్ టెక్నాలజీ యాక్ట్, 2000 (“ఐటి యాక్ట్”) పరంగా ఒక ఎలక్ట్రానిక్ రికార్డ్ మరియు వర్తించే నిబంధనలు మరియు ఎప్పటికప్పుడు సవరించిన వివిధ చట్టాలలో ఎలక్ట్రానిక్ రికార్డులకు సంబంధించిన నిబంధనలు.\n"
        "మీరు సమర్థుడని మరియు కాంట్రాక్టులో ప్రవేశించడానికి చట్టపరమైన సామర్థ్యాన్ని కలిగి ఉన్నారని మీరు మాకు ప్రాతినిధ్యం వహిస్తున్నారు మరియు హామీ ఇస్తున్నారు (అనగా మీకు కనీసం 18 సంవత్సరాలు నిండింది, కాంట్రాక్ట్ చట్టం ప్రకారం ఒప్పందాలు కుదుర్చుకునే సామర్థ్యం మీకు ఉంది).\n"
        "1.\n"
        "1.1 సాధారణంగా. మీరు కింది నిబంధనలు మరియు షరతులకు అనుగుణంగా వెబ్‌సైట్, ఉత్పత్తులు, సేవ లేదా ఫీచర్ యొక్క కంటెంట్లను యాక్సెస్ చేయవచ్చు. మీరు ఈ నిబంధనలు మరియు షరతులు మరియు వెబ్‌సైట్ యొక్క మీ ఉపయోగానికి వర్తించే అన్ని చట్టాలు, నియమాలు మరియు నిబంధనలకు అనుగుణంగా వ్యవహరిస్తారు.\n"
        "1.2 ట్రూక్అప్‌కు మీరు అందించిన సమాచారం సరైనది మరియు చెల్లుబాటు అయ్యేదని మీరు చేపట్టారు మరియు హామీ ఇస్తున్నారు. ఏదైనా తప్పుడు సమాచారం / వంచన / తప్పుడు సమాచారం ఇవ్వడం, మీరు పరిణామాలకు బాధ్యత వహిస్తారు మరియు అటువంటి ఉల్లంఘన కారణంగా TRUKAPP ఎదుర్కోవలసి వచ్చే అటువంటి నష్టం, నష్టం, పరిణామాలకు వ్యతిరేకంగా మీరు TRUKAPP కి నష్టపరిహారం చెల్లించాలి. అందించిన సమాచారం తప్పు అని తేలితే, ఈ నిబంధనలు మరియు షరతుల ప్రకారం any హించిన ఏ నిబంధనలకు పక్షపాతం లేకుండా TRUKAPP వెంటనే వెబ్‌సైట్‌కు ప్రాప్యతను నిరాకరించవచ్చు, TRUKAPP మీకు వ్యతిరేకంగా అలాంటి చర్యలను కూడా ప్రారంభించవచ్చు.\n"
        "1.3 వెబ్‌సైట్ యొక్క మీ నిరంతర ఉపయోగం మీకు మరియు ట్రూకాప్‌కు మధ్య చట్టబద్ధంగా అమలు చేయదగిన ఒప్పందంగా పనిచేస్తుంది.\n"
        "2.\n"
        "2.1. వెబ్‌సైట్, ఉత్పత్తులు, సేవలు లేదా లక్షణాలకు. మేము ఏదైనా లేదా అన్ని సేవా సమర్పణలను మార్చవచ్చు లేదా నిలిపివేయవచ్చు లేదా ఎప్పటికప్పుడు ఏదైనా లేదా అన్ని సేవా సమర్పణల కార్యాచరణను మార్చవచ్చు లేదా తొలగించవచ్చు.\n"
        "3.\n"
        "3.1 మీరు వెబ్‌సైట్ యొక్క ఉపయోగం యొక్క షరతుగా, మీరు చట్టవిరుద్ధమైన లేదా ఉపయోగ నిబంధనల ద్వారా నిషేధించబడిన ఏ ప్రయోజనం (ల) కోసం వెబ్‌సైట్‌ను ఉపయోగించకూడదు. ఏదైనా ట్రూక్అప్ సర్వర్, లేదా ఏదైనా ట్రూక్అప్ సర్వర్‌కు అనుసంధానించబడిన నెట్‌వర్క్ (లు) దెబ్బతినడం, నిలిపివేయడం, అధిక భారం లేదా బలహీనపరిచే విధంగా మీరు వెబ్‌సైట్‌ను ఉపయోగించకూడదు లేదా ఇతర పార్టీల ఉపయోగం మరియు దానితో సంబంధం ఉన్న ఏదైనా సేవలను ఆస్వాదించడంలో జోక్యం చేసుకోకూడదు. వెబ్‌సైట్. హ్యాకింగ్, పాస్‌వర్డ్ మైనింగ్ లేదా మరే ఇతర మార్గాల ద్వారా వెబ్‌సైట్, ఇతర ఖాతాలు, కంప్యూటర్ సిస్టమ్స్ లేదా ఏదైనా ట్రూక్అప్ సర్వర్‌కు అనుసంధానించబడిన వెబ్‌సైట్‌కు లేదా వెబ్‌సైట్‌తో అనుబంధించబడిన ఏదైనా సేవలకు అనధికార ప్రాప్యతను పొందడానికి మీరు ప్రయత్నించకూడదు.\n"
        "4.\n"
        "4.1 సేవా సమర్పణలపై మరియు అన్ని సంబంధిత సాంకేతిక పరిజ్ఞానం మరియు మేధో సంపత్తి హక్కులపై మాకు అన్ని హక్కులు, శీర్షికలు మరియు ఆసక్తి ఉన్నాయి. ఈ నిబంధనలు మరియు షరతుల నిబంధనలకు లోబడి, ఈ క్రింది వాటిని చేయడానికి మేము మీకు పరిమితమైన, ఉపసంహరించుకోలేని, ప్రత్యేకత లేని, ఉప-లైసెన్స్ లేని, బదిలీ చేయలేని లైసెన్స్‌ను మంజూరు చేస్తాము: (ఎ) ఈ నిబంధనలకు అనుగుణంగా సేవలను మాత్రమే యాక్సెస్ చేయండి మరియు వాడండి. మరియు పరిస్థితులు; ఏదైనా సంబంధిత మేధో సంపత్తి హక్కులతో సహా, సేవా సమర్పణలకు మా అనుబంధ సంస్థలైన మా నుండి ఈ నిబంధనలు మరియు షరతుల ప్రకారం మీరు ఎటువంటి హక్కులను పొందలేరు.\n"
        "4.2 లైసెన్స్ పరిమితులు. ఈ నిబంధనలు మరియు షరతులలో అందించిన విధంగా మీరు వెబ్‌సైట్‌ను ఉపయోగించాలి. ఈ నిబంధనలు మరియు షరతుల ద్వారా స్పష్టంగా అనుమతించబడటం మినహా మీరు ఏ ఉద్దేశానికైనా వెబ్‌సైట్‌ను ఉపయోగించకూడదు. వెబ్‌సైట్, ఉత్పత్తులు, సేవలు లేదా లక్షణాలలో ఏదైనా కంటెంట్ యొక్క ఉత్పన్న రచనలను సవరించడానికి, పంపిణీ చేయడానికి, మార్చడానికి, మరమ్మత్తు చేయడానికి, రివర్స్ ఇంజనీర్ చేయడానికి లేదా సృష్టించడానికి మీరు ప్రయత్నించరు. మా మరియు మీ మధ్య ఉన్న సంబంధాన్ని మీరు తప్పుగా సూచించరు లేదా అలంకరించరు (మీకు లేదా మీ వ్యాపార ప్రయత్నాలకు మేము మద్దతు ఇస్తున్నాము, స్పాన్సర్ చేస్తాము, ఆమోదించాము లేదా దోహదం చేస్తామని వ్యక్తీకరించడం లేదా సూచించడం ద్వారా).\n"
        "5.\n"
        "5.1 జనరల్. మీరు, మా అనుబంధ సంస్థలు మరియు మా / వారి సంబంధిత ఉద్యోగులు, అధికారులు, డైరెక్టర్లు మరియు ప్రతినిధులు ప్రతి మూడవ పక్షం దావా నుండి సంభవించే లేదా వాటికి సంబంధించిన ఏదైనా నష్టాల నుండి మరియు వ్యతిరేకంగా మీరు రక్షించుకుంటారు, నష్టపరిహారం ఇస్తారు: (ఎ) మీ వెబ్‌సైట్, ఉత్పత్తులు, సేవలు లేదా లక్షణాల ఉపయోగం; (బి) ఈ నిబంధనలు మరియు షరతుల ఉల్లంఘన లేదా మీరు వర్తించే చట్టాన్ని ఉల్లంఘించడం; లేదా సహేతుకమైన న్యాయవాదుల ఫీజుల కోసం, అలాగే మా ఉద్యోగులు మరియు కాంట్రాక్టర్ల సమయం మరియు ఏదైనా మూడవ పార్టీ నోటీసులు లేదా ఇతర తప్పనిసరి చట్టపరమైన ఆర్డర్ లేదా మూడవ పార్టీ దావాలతో సంబంధం ఉన్న ప్రక్రియకు ప్రతిస్పందించడానికి ఖర్చు చేసిన పదార్థాల కోసం మీరు తిరిగి చెల్లించాల్సిన బాధ్యత మీకు ఉంటుంది. / నష్టాలు.\n"
        "6. వెబ్‌సైట్ మరియు దాని లక్షణాలు “ఉన్నట్లే” అందించబడ్డాయి. చట్టం ద్వారా నిషేధించబడిన పరిధికి మినహా, లేదా మినహాయించలేని, పరిమితం చేయబడిన లేదా మాఫీ చేయలేని చట్టబద్ధమైన హక్కులు వర్తించేంతవరకు, మేము మరియు మా అనుబంధ సంస్థలు (ఎ) ఎక్స్ప్రెస్, సూచించిన, చట్టబద్ధమైన లేదా ఇతరత్రా ఎలాంటి ప్రాతినిధ్యాలు లేదా వారెంటీలు ఇవ్వవు. సేవా సమర్పణలు లేదా మూడవ పార్టీ కంటెంట్, మరియు (బి) వర్తకత్వం, సంతృప్తికరమైన నాణ్యత, ఒక నిర్దిష్ట ప్రయోజనం కోసం ఫిట్‌నెస్, ఉల్లంఘన లేదా నిశ్శబ్ద ఆనందం, (ii) యొక్క ఏదైనా సూచించిన లేదా ఎక్స్‌ప్రెస్ వారెంటీలతో సహా అన్ని వారెంటీలను నిరాకరించండి. (iii) సేవా సమర్పణలు లేదా మూడవ పార్టీ కంటెంట్ నిరంతరాయంగా ఉంటుంది, లోపం లేకుండా లేదా హానికరమైన భాగాలు లేకుండా ఉంటుంది మరియు (iv) ఏదైనా కంటెంట్ సురక్షితంగా ఉంటుంది లేదా కోల్పోదు లేదా మార్చబడింది\n"
        "7. ఒక పార్టీ అయినా, ప్రత్యక్ష, పరోక్ష, యాదృచ్ఛిక, ప్రత్యేక, పర్యవసానంగా లేదా ఆదర్శప్రాయమైన నష్టాలకు (లాభాలు, ఆదాయాలు, కస్టమర్లు, అవకాశాలు, సద్భావన, ఉపయోగం లేదా డేటా నష్టానికి నష్టాలతో సహా) మేము మరియు మా అనుబంధ సంస్థలు మీకు బాధ్యత వహించవు. అటువంటి నష్టాలకు అవకాశం ఉందని సలహా ఇచ్చారు. అంతేకాకుండా, దీనికి సంబంధించి తలెత్తే పరిహారం, రీయింబర్స్‌మెంట్ లేదా నష్టాలకు మేము లేదా మా అనుబంధ సంస్థలు ఎవరూ బాధ్యత వహించరు: (ఎ) ఈ ఒప్పందాన్ని రద్దు చేయడం లేదా నిలిపివేయడం వంటి వాటితో సహా సేవలను ఉపయోగించడంలో మీ అసమర్థత. లేదా సేవా సమర్పణల యొక్క మీ ఉపయోగం లేదా ప్రాప్యత, (ii) ఏదైనా లేదా అన్ని సేవా సమర్పణలను మా నిలిపివేయడం, లేదా, (iii) ఆర్డర్ స్థాయి ఒప్పందాల ప్రకారం ఎటువంటి బాధ్యతలను పరిమితం చేయకుండా, అన్ని or హించని లేదా అనాలోచిత సమయ వ్యవధి లేదా ఒక భాగం ఏ కారణం చేతనైనా సేవలు; (బి) ప్రత్యామ్నాయ వస్తువులు లేదా సేవల సేకరణ ఖర్చు; (సి) ఈ ఒప్పందానికి సంబంధించి మీరు చేసిన పెట్టుబడులు, ఖర్చులు లేదా కట్టుబాట్లు లేదా సేవా సమర్పణల యొక్క మీ ఉపయోగం లేదా ప్రాప్యత; లేదా (డి) మీ కంటెంట్ లేదా ఇతర డేటాను నిల్వ చేయడంలో అనధికార ప్రాప్యత, మార్పు, లేదా తొలగించడం, నాశనం, నష్టం, నష్టం లేదా వైఫల్యం.\n"
        "8. TRUKAPP వెబ్‌సైట్‌లో సవరించిన సంస్కరణను పోస్ట్ చేయడం ద్వారా మేము ఈ నిబంధనలు మరియు షరతులను (ఏదైనా విధానాలతో సహా) ఎప్పుడైనా సవరించవచ్చు; ఈ నిబంధనలు మరియు షరతులకు ఏవైనా సవరణలు చేసిన తేదీ తర్వాత వెబ్‌సైట్‌ను ఉపయోగించడం కొనసాగించడం ద్వారా, మీరు సవరించిన నిబంధనలకు కట్టుబడి ఉంటారని అంగీకరిస్తున్నారు. ఈ నిబంధనలు మరియు షరతులకు సవరణల కోసం TRUKAPP సైట్‌ను క్రమం తప్పకుండా తనిఖీ చేయడం మీ బాధ్యత. ఈ నిబంధనలు మరియు షరతుల చివరలో పేర్కొన్న తేదీలో ఈ నిబంధనలు చివరిగా సవరించబడ్డాయి.\n"
        "9. గోప్యతా విధానం\n"
        "9.1 మా సేవలను పొందటానికి లేదా ఈ వెబ్‌సైట్ యొక్క ప్రయోజనాన్ని పొందడానికి మీ వ్యక్తిగత సమాచారాన్ని అందించమని మిమ్మల్ని అడగవచ్చు. రవాణా వివరాలు, రిజిస్ట్రేషన్ సమయంలో మీరు మాకు అందించిన వ్యక్తిగత సమాచారం, ఆర్డర్ బుకింగ్, ఏదైనా వర్తించే చట్టం ప్రకారం అవసరమైతే తప్ప, లేదా మాకు అవసరమైన పరిమిత స్థాయిలో పంచుకోకుండా ఉండటానికి మేము అన్ని సహేతుకమైన ప్రయత్నం చేస్తాము. ఒక ట్రక్కును ఉంచండి మరియు మా సేవా భాగస్వాములు / మార్కెట్ అద్దెదారుల ద్వారా అవసరమైన సేవలను అందించండి, మా ఉత్పత్తులు, సేవలు, కంటెంట్ మరియు ప్రకటనలను అందించడానికి మరియు మెరుగుపరచడానికి ఇతర సమాచారంతో కూడా మిళితం చేయవచ్చు. మీ సమాచారం ఇష్టపూర్వకంగా లేదా అనుకోకుండా ఏదైనా మూడవ పక్షంతో మీరు పంచుకున్న ఏ సందర్భంలోనైనా పరిణామాలకు మేము ఎటువంటి బాధ్యత వహించము.\n"
        "9.2 మీ రిజిస్టర్డ్ ఫోన్ నంబర్ మరియు / లేదా ఇ-మెయిల్ చిరునామా ద్వారా మా నుండి కమ్యూనికేషన్లను స్వీకరించడానికి మీరు దీని ద్వారా స్పష్టంగా అంగీకరిస్తున్నారు. ఫోన్ కాల్స్, ఇమెయిళ్ళు మరియు / లేదా SMS నోటిఫికేషన్ల ద్వారా మమ్మల్ని సంప్రదించడానికి మీరు అంగీకరిస్తున్నారు. మా నుండి మీరు అందుకున్న ఏదైనా కమ్యూనికేషన్ స్పామ్, అయాచిత కమ్యూనికేషన్ లేదా జాతీయంగా మీ రిజిస్ట్రేషన్ ఉల్లంఘనకు రిజిస్ట్రేషన్ అని పిలవదని మీరు అంగీకరిస్తున్నారు.\n"
        "9.3 మీరు అప్లికేషన్ ద్వారా లేదా ఈ వెబ్‌సైట్ ద్వారా మాకు అందించే ఏదైనా సేవ ద్వారా మీరు మాకు పంపిన ఏదైనా సందేశం లేదా ప్రసారం యొక్క మూలాన్ని దాచిపెట్టడానికి మీరు శీర్షికలను నకిలీ చేయకూడదు లేదా ఐడెంటిఫైయర్‌లను మార్చకూడదు.\n"
        "9.4 ఈ నిబంధనలు మరియు షరతుల ద్వారా చట్టవిరుద్ధమైన లేదా నిషేధించబడిన ఏ ఉద్దేశానికైనా లేదా మా హక్కులను ఉల్లంఘించే లేదా ఏదైనా మూడవ పక్షం యొక్క ఏదైనా చట్టవిరుద్ధమైన కార్యకలాపాల పనితీరును అభ్యర్థించడానికి మీరు ఈ వెబ్‌సైట్‌ను లేదా ఇక్కడ అందించిన ఏదైనా కంటెంట్‌ను ఉపయోగించకూడదు.\n"
        "9.5 ఏదైనా చట్టం, నిబంధనలను సంతృప్తి పరచడానికి లేదా ఏదైనా ప్రభుత్వం కోరినట్లుగా ఏదైనా సమాచారాన్ని (వెబ్‌సైట్‌లో సమాచారం లేదా సామగ్రిని అందించే వ్యక్తి యొక్క గుర్తింపుతో సహా) బహిర్గతం చేయడానికి TRUKAPP కి అన్ని హక్కులు ఉన్నాయని మీరు అర్థం చేసుకోవాలి. ఏజెన్సీ. ఈ సందర్భంలో, మీరు అటువంటి ప్రభుత్వానికి ప్రాతినిధ్యం వహిస్తున్న మీ / సంస్థ యొక్క అటువంటి సమాచారాన్ని పంచుకోవడానికి మీరు మాకు అధికారం ఇస్తారు. ఏజెన్సీ.\n"
        "10.\n"
        "10.1 ఈ నిబంధనలు మరియు షరతుల ప్రకారం ఏదైనా ఆలస్యం లేదా వైఫల్యానికి మేము మరియు మా అనుబంధ సంస్థలు బాధ్యత వహించవు, ఇక్కడ దేవుని చర్యలు, కార్మిక వివాదాలు లేదా ఇతర వాటితో సహా మా సహేతుకమైన నియంత్రణకు మించిన ఏ కారణం అయినా ఆలస్యం లేదా వైఫల్యం సంభవిస్తుంది. పారిశ్రామిక ఆటంకాలు, విద్యుత్ లేదా విద్యుత్తు అంతరాయాలు, యుటిలిటీస్ లేదా ఇతర టెలికమ్యూనికేషన్ వైఫల్యాలు, భూకంపం, తుఫానులు లేదా ప్రకృతి యొక్క ఇతర అంశాలు, అడ్డంకులు, ఆంక్షలు, అల్లర్లు, చర్యలు లేదా ప్రభుత్వ ఆదేశాలు, ఉగ్రవాద చర్యలు లేదా యుద్ధం.\n"
        "10.2 భారతదేశ చట్టాలు, చట్ట నిబంధనల సంఘర్షణను సూచించకుండా, ఈ నిబంధనలు మరియు షరతులను మరియు మీకు మరియు మా మధ్య తలెత్తే ఏ విధమైన వివాదాన్ని నియంత్రిస్తాయి.\n"
        "10.3 వెబ్‌సైట్ యొక్క మీ వినియోగానికి, లేదా TRUKAPP చేత విక్రయించబడిన లేదా పంపిణీ చేయబడిన ఏదైనా ఉత్పత్తులు లేదా సేవలకు సంబంధించిన ఏదైనా వివాదం లేదా దావా మధ్యవర్తిత్వం ద్వారా, మధ్యవర్తిత్వ మరియు సయోధ్య చట్టం, 1996 ప్రకారం పరిష్కరించబడుతుంది లేదా తదుపరి సవరణలు అదే. మధ్యవర్తిత్వ ప్రదేశం బెంగళూరు. మధ్యవర్తిత్వం యొక్క భాష ఆంగ్లంలో ఉండాలి.\n"
        "10.4 మీరు వర్తించే అన్ని చట్టాలు, నియమాలు మరియు నిబంధనలకు లోబడి ఉండాలి.\n"
        "10.5 ఈ నిబంధనలు మరియు షరతులకు అనుగుణంగా చేసిన లేదా ఇచ్చిన అన్ని కమ్యూనికేషన్లు మరియు నోటీసులు ఆంగ్ల భాషలో ఉండాలి. మేము ఈ నిబంధనలు మరియు షరతుల యొక్క ఆంగ్ల భాషా సంస్కరణ యొక్క అనువాదాన్ని అందిస్తే, ఏదైనా సంఘర్షణ ఉంటే నిబంధనలు మరియు షరతుల యొక్క ఆంగ్ల భాషా వెర్షన్ నియంత్రిస్తుంది.\n"
        "10.6 మీరు TRUKAPP రహస్య సమాచారాన్ని టర్మ్ సమయంలో లేదా పదం ముగిసిన 5 సంవత్సరాల కాలంలో ఎప్పుడైనా వెల్లడించరు. TRUKAPP రహస్య సమాచారం యొక్క బహిర్గతం, వ్యాప్తి లేదా అనధికార వాడకాన్ని నివారించడానికి మీరు అన్ని సహేతుకమైన చర్యలను తీసుకుంటారు, కనీసం, ఇలాంటి స్వభావం గల మీ స్వంత రహస్య సమాచారాన్ని రక్షించడానికి మీరు తీసుకునే చర్యలు. ఈ నిబంధనలు మరియు షరతులకు సంబంధించి లేదా ట్రూక్అప్ అందించే సేవ యొక్క మీ ఉపయోగానికి సంబంధించి మీరు ఏ పత్రికా ప్రకటనను జారీ చేయరు లేదా మరే ఇతర పబ్లిక్ కమ్యూనికేషన్ చేయరు.\n"
        "10.7 ఈ నిబంధనలు మరియు షరతులలో పేర్కొన్నవి తప్ప, ఈ నిబంధనలు మరియు షరతులు ఏ వ్యక్తి లేదా సంస్థలో మూడవ పార్టీ లబ్ధిదారుల హక్కులను సృష్టించవు.\n"
        "10.8 ఈ నిబంధనలు మరియు షరతుల యొక్క ఏదైనా నిబంధనను అమలు చేయడంలో మాకు వైఫల్యం అటువంటి నిబంధన యొక్క ప్రస్తుత లేదా భవిష్యత్తు మినహాయింపును కలిగి ఉండదు లేదా తరువాతి సమయంలో అటువంటి నిబంధనను అమలు చేసే మన హక్కును పరిమితం చేయదు. మా ద్వారా అన్ని మాఫీలు ప్రభావవంతంగా ఉండటానికి వ్రాతపూర్వకంగా ఉండాలి.\n"
        "10.9 ఈ నిబంధనలు మరియు షరతుల యొక్క ఏదైనా భాగం చెల్లనిది లేదా అమలు చేయలేనిది అని భావిస్తే, నిబంధనలు మరియు షరతుల యొక్క మిగిలిన భాగాలు పూర్తి శక్తి మరియు ప్రభావంతో ఉంటాయి. ఏదైనా చెల్లని లేదా అమలు చేయలేని భాగాలు అసలు భాగం యొక్క ప్రభావానికి మరియు ఉద్దేశ్యానికి వివరించబడతాయి. అటువంటి నిర్మాణం సాధ్యం కాకపోతే, చెల్లని లేదా అమలు చేయలేని భాగం ఈ నిబంధనలు మరియు షరతుల నుండి తెగిపోతుంది, కాని మిగిలిన నిబంధనలు మరియు షరతులు పూర్తి శక్తి మరియు ప్రభావంతో ఉంటాయి.\n"
        "11.\n"
        "వెబ్‌సైట్ మూడవ పార్టీల సమాచారాన్ని అందుబాటులో ఉంచుతుంది, వాటిలో కథనాలు, విశ్లేషకుల నివేదికలు, వార్తా నివేదికలు, గణనను సులభతరం చేసే సాధనాలు, కంపెనీ సమాచారం మరియు ఆర్థిక మార్కెట్ల గురించి డేటా, ఏదైనా నియంత్రణ అధికారం మరియు ఇతర ఆర్థిక మార్కెట్లు మరియు బాహ్య వనరుల నుండి ఇతర డేటా (\"థర్డ్ పార్టీ\" \"విషయము\"). మూడవ పార్టీ కంటెంట్ ట్రూక్అప్ చేత సృష్టించబడలేదు లేదా ఆమోదించబడలేదని మీరు గుర్తించి, అంగీకరిస్తున్నారు. థర్డ్ పార్టీ కంటెంట్ యొక్క నిబంధన సాధారణ సమాచార ప్రయోజనాల కోసం మాత్రమే మరియు ఏదైనా సెక్యూరిటీలు లేదా వాటాలను కొనుగోలు చేయడానికి లేదా విక్రయించడానికి లేదా మరేదైనా పెట్టుబడి లేదా పెట్టుబడి నిర్ణయం తీసుకోవడానికి సిఫారసు లేదా విన్నపం కాదు. అదనంగా, మూడవ పార్టీ కంటెంట్ పన్ను, చట్టపరమైన లేదా పెట్టుబడి సలహాలను అందించడానికి ఉద్దేశించినది కాదు. మీకు అందించిన థర్డ్ పార్టీ కంటెంట్ నమ్మదగినదని నమ్ముతున్న మూలాల నుండి పొందబడిందని మీరు అంగీకరిస్తున్నారు, అయితే ట్రూక్అప్ లేదా మూడవ పార్టీ కంటెంట్ యొక్క ప్రొవైడర్లు దాని ఖచ్చితత్వం, పరిపూర్ణత, సమయస్ఫూర్తికి ఎటువంటి హామీలు ఇవ్వలేదు.\n"
        "ఏదైనా మూడవ పార్టీ కంటెంట్‌ను ఉపయోగించడం ద్వారా, మీరు ఈ వెబ్‌సైట్‌ను వదిలి బాహ్య వెబ్‌సైట్‌కు లేదా ట్రూక్అప్ కాకుండా వేరే ఎంటిటీచే నిర్వహించబడే వెబ్‌సైట్‌కు పంపబడవచ్చు. మీరు అలాంటి ఏదైనా సైట్‌ను సందర్శించాలని నిర్ణయించుకుంటే, మీరు మీ స్వంత పూచీతో అలా చేస్తారు మరియు వైరస్లు లేదా ఇతర విధ్వంసక అంశాల నుండి రక్షణ కల్పించడానికి అన్ని రక్షణ చర్యలు తీసుకోవడం మీ బాధ్యత. ట్రూక్అప్ ఎటువంటి అనుసంధాన వెబ్‌సైట్‌లు లేదా దానిపై కనిపించే సమాచారం లేదా దానిపై వివరించిన ఉత్పత్తులు లేదా సేవలకు సంబంధించి ఎటువంటి వారెంటీ లేదా ప్రాతినిధ్యం ఇవ్వదు మరియు ఆమోదించదు. ట్రూక్‌అప్ లేదా ఈ వెబ్‌సైట్ స్పాన్సర్‌లు, ఆమోదించడం, అనుబంధించబడిందని లేదా అనుబంధించబడిందని లేదా లింక్‌ల ద్వారా ప్రదర్శించబడే లేదా ప్రాప్యత చేయగల ఏదైనా ట్రేడ్‌మార్క్, వాణిజ్య పేరు, లోగో లేదా కాపీరైట్ చిహ్నాన్ని ఉపయోగించడానికి చట్టబద్ధంగా అధికారం ఉందని లింకులు సూచించవు. ట్రూక్అప్ లేదా దాని అనుబంధ సంస్థలు లేదా అనుబంధ సంస్థలలో ఏదైనా ట్రేడ్మార్క్, వాణిజ్య పేరు, లోగో లేదా కాపీరైట్ చిహ్నాన్ని ఉపయోగించడం.\n"
        "ట్రూక్అప్ కస్టమర్లకు థర్డ్ పార్టీ విక్రేతలు అందించే సేవల కోసం, వస్తువుల నష్టానికి లేదా వస్తువుల గమ్యం ఉన్న ప్రదేశంలో డెలివరీ ఆలస్యం కావడానికి ట్రూక్అప్ బాధ్యత వహించదు. బుకింగ్ పూర్తయిన తర్వాత, కస్టమర్ మరియు విక్రేత యొక్క పరస్పర అవగాహనతో చేసిన ఏవైనా మార్పులు లేదా మార్పులకు ట్రూక్అప్ బాధ్యత వహించదు. ట్రూక్అప్ అనేది పార్టీల మధ్య లావాదేవీలను ప్రారంభించడానికి ఒక వేదిక, అనగా, విక్రేత మరియు కస్టమర్. ఈ దృష్టాంతంలో విక్రేత లాజిస్టిక్స్ భాగస్వామి లేదా ట్రక్ ప్రొవైడర్ / లు లేదా వ్యక్తిగత ట్రక్ యజమానులు లేదా ట్రక్ డ్రైవర్లు; కస్టమర్ సేవను బుక్ చేసే వ్యక్తి.",
    "about_text":"ట్రూకాప్ అనేది షిప్పర్లను లైవ్ ట్రక్ మార్కెట్‌కు అనుసంధానించడం మరియు దేశవ్యాప్తంగా ఇబ్బంది లేని కార్గో షిప్‌మెంట్ బుకింగ్‌ను ప్రారంభించడం. ట్రక్ లోడ్ ఐడెంటిఫికేషన్, ఫ్లీట్ మేనేజ్‌మెంట్ సర్వీసెస్ వంటి అనేక ఇతర సేవలను మేము ట్రాన్స్‌పోర్టర్లకు మా అత్యాధునిక సాంకేతిక పరిజ్ఞానాల ద్వారా అందిస్తాము.\n\n"
        "దీనిని 2021 జనవరిలో ఎన్‌ఐటి వరంగల్ అల్మామాటర్ నుండి ఉద్వేగభరితమైన పారిశ్రామికవేత్తల బృందం స్థాపించింది.\n\n"
        "ఇంటర్‌సిటీ నుండి ఇంట్రాసిటీ రవాణా వరకు లాజిస్టిక్‌లను సరళీకృతం చేయడానికి ట్రూక్అప్ ఇక్కడ ఉంది, పూర్తి ట్రక్ లోడ్ నుండి పాక్షిక ట్రక్ లోడ్ డెలివరీలు, ఏ రకమైన సరుకుకు అయినా ట్రక్ స్థలాన్ని గుర్తించడం మరియు రవాణాదారులకు ఫ్లీట్ మేనేజ్‌మెంట్ ఇంటర్‌ఫేస్ కొన్నింటిని పేరు పెట్టడం.\n\n"
        "టెక్నాలజీ సహాయంతో, ట్రూక్అప్ కార్గో డెలివరీ జీవిత చక్రం ప్రారంభం నుండి చివరి వరకు ప్రపంచ స్థాయి మద్దతును అందిస్తుంది. రియల్ టైమ్ కార్గో ట్రాకింగ్, ఫ్రైట్ సెక్యూరిటీ, ఫ్లీట్ మేనేజ్‌మెంట్, ఇంటిగ్రేటెడ్ పేమెంట్ గేట్‌వే వంటి మా టెక్నాలజీస్ షిప్పర్స్ మరియు ట్రాన్స్‌పోర్టర్స్ రెండింటినీ వారి చేతివేళ్లపై లావాదేవీలు చేయడానికి వీలు కల్పిస్తాయి.\n\n"
        "ఇది మేము, ట్రూక్అప్ - లాజిస్టిక్స్ సరళీకృతం!",
    LocaleKey.cancelled: "రద్దు చేసిన బుకింగ్",
  };
}
